# ASR Reference Vocabulary for French-Fongbe Dataset
# Essential words for Automatic Speech Recognition systems
# Organized by category for low-resource language ASR training
# Based on best practices for speech recognition in African languages

# Numbers (0-100)
zéro
un
deux
trois
quatre
cinq
six
sept
huit
neuf
dix
onze
douze
treize
quatorze
quinze
seize
vingt
trente
quarante
cinquante
soixante
cent
mille

# Time expressions
aujourd
demain
hier
matin
midi
soir
nuit
jour
semaine
mois
année
heure
minute
seconde
maintenant
bientôt
tard
tôt

# Common verbs
être
avoir
faire
aller
venir
dire
pouvoir
vouloir
devoir
savoir
prendre
donner
voir
mettre
parler
demander
trouver
passer
laisser
suivre
penser
appeler
continuer
commencer
finir
aimer
regarder
écouter
comprendre
apprendre
manger
boire
dormir
marcher
courir
acheter
vendre
payer
travailler
étudier

# Common nouns - People
homme
femme
enfant
garçon
fille
père
mère
frère
soeur
famille
ami
personne
gens
bébé
adulte
vieux
jeune

# Common nouns - Places
maison
école
marché
hôpital
ville
village
pays
rue
route
champ
jardin
église
bureau
magasin
restaurant
banque
poste
gare
aéroport

# Common nouns - Things
chose
eau
nourriture
pain
riz
viande
poisson
fruit
légume
argent
livre
papier
stylo
téléphone
voiture
vélo
porte
fenêtre
table
chaise
lit
vêtement
chaussure
sac
clé
montre

# Body parts
tête
main
pied
oeil
oreille
nez
bouche
bras
jambe
coeur
corps
dos
ventre

# Colors
blanc
noir
rouge
bleu
vert
jaune
orange
rose
gris
marron

# Adjectives - Common
bon
mauvais
grand
petit
long
court
haut
bas
large
étroit
chaud
froid
nouveau
vieux
jeune
beau
joli
laid
facile
difficile
rapide
lent
fort
faible
riche
pauvre
plein
vide
propre
sale
ouvert
fermé
content
triste
heureux
malade
sain

# Prepositions and conjunctions
dans
sur
sous
avec
sans
pour
par
de
à
en
chez
vers
contre
entre
parmi
et
ou
mais
donc
car
si
quand
comme
pendant
avant
après
depuis
jusqu
parce
puisque
lorsque

# Pronouns
je
tu
il
elle
nous
vous
ils
elles
on
me
te
le
la
les
lui
leur
moi
toi
ce
cela
ça
qui
que
quoi
où
comment
pourquoi
combien
quel
quelle

# Articles
le
la
les
un
une
des
du
de
au
aux

# Question words
qui
que
quoi
où
quand
comment
pourquoi
combien
quel

# Negation
ne
pas
non
jamais
rien
personne
plus
aucun

# Common expressions
oui
non
merci
bonjour
bonsoir
bonne
salut
pardon
excusez
bienvenue
au revoir
adieu

# Domain-specific - Health
médecin
infirmière
docteur
patient
maladie
médicament
traitement
consultation
fièvre
douleur
toux
rhume
grippe
vaccin
santé
soigner
guérir

# Domain-specific - Education
professeur
enseignant
élève
étudiant
classe
leçon
cours
examen
devoir
note
diplôme
université
collège
lycée

# Domain-specific - Commerce
vendeur
acheteur
client
prix
coût
cher
bon marché
vendre
acheter
payer
argent
monnaie
facture
reçu

# Domain-specific - Agriculture
fermier
agriculteur
champ
terre
cultiver
planter
récolter
semence
engrais
irrigation
maïs
riz
manioc
igname
tomate
oignon
haricot
arachide
coton

# Domain-specific - Family
famille
parent
enfant
père
mère
fils
fille
frère
soeur
grand-père
grand-mère
oncle
tante
cousin
cousine
neveu
nièce
mari
femme
époux
épouse

# Weather
temps
soleil
pluie
vent
nuage
chaud
froid
sec
humide
saison
climat

# Animals
animal
chien
chat
oiseau
poule
coq
vache
chèvre
mouton
cochon
cheval
âne
poisson
serpent
insecte
